results/unused/fabio-512-run03/003_fio/cmd_63.output
libaio-bdev_xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=128
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666794406,
  "timestamp_ms" : 1666794406350,
  "time" : "Wed Oct 26 16:26:46 2022",
  "jobs" : [
    {
      "jobname" : "libaio-bdev_xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-bdev_xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "128",
        "bs" : "512",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_xnvme_libaio.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1716623872,
        "io_kbytes" : 1676390,
        "bw_bytes" : 245196953,
        "bw" : 239450,
        "iops" : 478885.873447,
        "runtime" : 7001,
        "total_ios" : 3352680,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1643,
          "max" : 23163,
          "mean" : 1826.220025,
          "stddev" : 130.262259,
          "N" : 3352681
        },
        "clat_ns" : {
          "min" : 4329,
          "max" : 440576,
          "mean" : 134721.766097,
          "stddev" : 72817.248924,
          "N" : 3352781,
          "percentile" : {
            "1.000000" : 11456,
            "5.000000" : 21632,
            "10.000000" : 34048,
            "20.000000" : 59648,
            "30.000000" : 84480,
            "40.000000" : 109056,
            "50.000000" : 134144,
            "60.000000" : 158720,
            "70.000000" : 185344,
            "80.000000" : 209920,
            "90.000000" : 234496,
            "95.000000" : 246784,
            "99.000000" : 264192,
            "99.500000" : 268288,
            "99.900000" : 276480,
            "99.950000" : 280576,
            "99.990000" : 280576
          }
        },
        "lat_ns" : {
          "min" : 6833,
          "max" : 442319,
          "mean" : 136547.987636,
          "stddev" : 72819.539489,
          "N" : 3352781
        },
        "bw_min" : 238629,
        "bw_max" : 240283,
        "bw_agg" : 100.000000,
        "bw_mean" : 239567.857143,
        "bw_dev" : 526.668317,
        "bw_samples" : 14,
        "iops_min" : 477258,
        "iops_max" : 480566,
        "iops_mean" : 479135.785714,
        "iops_stddev" : 1053.310545,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 38.671429,
      "sys_cpu" : 61.300000,
      "ctx" : 14,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.269605,
        "4" : 2.950893,
        "8" : 6.181950,
        "16" : 12.765072,
        "32" : 25.656937,
        ">=64" : 52.175513
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.203632,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.100000,
        "64" : 0.100000,
        ">=64" : 0.796279
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.908020,
        "20" : 3.712672,
        "50" : 11.748601,
        "100" : 19.858114,
        "250" : 59.730216,
        "500" : 4.045391,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 128,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

libaio-bdev_xnvme: (groupid=0, jobs=1): err= 0: pid=16543: Wed Oct 26 16:26:46 2022
  read: IOPS=479k, BW=234MiB/s (245MB/s)(1637MiB/7001msec)
    slat (nsec): min=1643, max=23163, avg=1826.22, stdev=130.26
    clat (usec): min=4, max=440, avg=134.72, stdev=72.82
     lat (usec): min=6, max=442, avg=136.55, stdev=72.82
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   22], 10.00th=[   35], 20.00th=[   60],
     | 30.00th=[   85], 40.00th=[  110], 50.00th=[  135], 60.00th=[  159],
     | 70.00th=[  186], 80.00th=[  210], 90.00th=[  235], 95.00th=[  247],
     | 99.00th=[  265], 99.50th=[  269], 99.90th=[  277], 99.95th=[  281],
     | 99.99th=[  281]
   bw (  KiB/s): min=238629, max=240283, per=100.00%, avg=239567.86, stdev=526.67, samples=14
   iops        : min=477258, max=480566, avg=479135.79, stdev=1053.31, samples=14
  lat (usec)   : 10=0.91%, 20=3.71%, 50=11.75%, 100=19.86%, 250=59.73%
  lat (usec)   : 500=4.05%
  cpu          : usr=38.67%, sys=61.30%, ctx=14, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.3%, 4=3.0%, 8=6.2%, 16=12.8%, 32=25.7%, >=64=52.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.1%, >=64=0.8%
     issued rwts: total=3352680,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=234MiB/s (245MB/s), 234MiB/s-234MiB/s (245MB/s-245MB/s), io=1637MiB (1717MB), run=7001-7001msec